Repository: eduNEXT/xblock-content-restrictions
Catalog: content_restrictions/conf/locale/*/LC_MESSAGES/text.po
Languages: es_es

source: Display Name
es_es: Nombre a mostrar

source: The display name for this component.
es_es: El nombre para mostrar de este componente.

source: Content With Access Restrictions
es_es: Contenidos con restricciones de acceso

source: Password Restriction
es_es: Restricción de contraseña

source: When enabled, the content will be restricted by password.
es_es: Si esta opción está activa, entonces el contenido estará restringido por contraseña.

source: Password Explanatory Message
es_es: Mensaje explicativo de la contraseña

source: This message will be shown when the learner is prompted to enter the password.
es_es: Este mensaje se mostrará cuando se pida al estudiante que introduzca la contraseña.

source: Please enter the password to access this content.
es_es: Introduzca la contraseña para acceder a este contenido.

source: Incorrect Password Explanatory Message
es_es: Mensaje explicativo de contraseña incorrecta

source: This message will be shown when the learner enters an incorrect password.
es_es: Este mensaje se mostrará cuando el estudiante introduzca una contraseña incorrecta.

source: Incorrect password. Please try again.
es_es: Contraseña incorrecta. Por favor, inténtelo de nuevo.

source: Password
es_es: Contraseña

source: Learners will need to type this password to access the content of the xblock. If the learner does not type the correct password, they will not have access to the content and will get an explanatory message instead. If the password is changed after the learner has already accessed the content, the learner will need to type the new password to access the content.
es_es: Los estudiantes deberán introducir esta contraseña para acceder al contenido del xblock. Si el estudiante no introduce la contraseña correcta, no tendrá acceso al contenido y recibirá un mensaje explicativo. Si la contraseña se cambia después de que el estudiante ya haya accedido al contenido, el estudiante tendrá que escribir la nueva contraseña para acceder al contenido.

source: IP Restriction
es_es: Restricción de IP

source: When enabled, the content will be restricted by IP address.
es_es: Si esta opción está activa, entonces el contenido estará restringido por dirección IP.

source: IP Whitelist
es_es: Lista blanca de IP

source: List of IP addresses or IP address ranges from which the content can be accessed. The compatible protocols are IPv4 and IPv6. If the learner's IP address is not in the whitelist, they will not have access to the content. The range should be in the CIDR format, e.g. (IPv4) "192.168.1.0/24", in this case only IP addresses from "192.168.1.0" to "192.168.1.255" can access to the content, or (IPv6) "2001:db8:85a3::/48", in this case only IP addresses from "2001:db8:85a3::" to "2001:db8:85a3:ffff:ffff:ffff:ffff:ffff" can access to the content. Also, a single IP address can be provided, e.g. (IPv4) "172.16.0.0", or (IPv6) "7ac:264a:dd69::". Alternatively, is possible mix IP addresses and IP ranges with different formats, e.g. ["192.168.1.0/24", "172.16.0.0", "65c1:e700::/24", "5c87::"]
es_es: Lista de direcciones IP o rangos de direcciones IP desde los cuales se puede acceder al contenido. Los protocolos compatibles son IPv4 e IPv6. Si la dirección IP del estudiante no está en la lista blanca, no tendrá acceso al contenido. El rango debe estar en formato CIDR, por ejemplo (IPv4) "192.168.1.0/24", en este caso solo las direcciones IP desde "192.168.1.0" hasta "192.168.1.255" pueden acceder al contenido, o (IPv6) "2001:db8:85a3::/48", en este caso solo las direcciones IP desde "2001:db8:85a3::" hasta "2001:db8:85a3:ffff:ffff:ffff:ffff:ffff" pueden acceder al contenido. También se puede proporcionar una sola dirección IP, por ejemplo (IPv4) "172.16.0.0", o (IPv6) "7ac:264a:dd69::". Alternativamente, es posible mezclar direcciones IP y rangos de direcciones IP con diferentes formatos, por ejemplo ["192.168.1.0/24", "172.16.0.0", "65c1:e700::/24", "5c87::"]

source: IP Restriction Explanatory Message
es_es: Mensaje explicativo de restricción por IP

source: This message will be shown when the learner is browsing from an IP address that is not whitelisted.
es_es: Este mensaje se mostrará cuando el estudiante esté navegando desde una dirección IP que no está en la lista blanca.

source: You are entering from an IP address that is not whitelisted. Please follow the instructions provided in the course introduction video.
es_es: Está accediendo desde una dirección IP que no está en la lista blanca. Por favor, siga las instrucciones proporcionadas en el video de introducción del curso.

source: SEB Restriction
es_es: Restricción por SEB

source: When enabled, the content will be restricted to be accessed only from Safe Exam Browser. IMPORTANT: To use this restriction "seb-openedx" plugin must be installed in the Open edX platform. It is also recommended to have the Individual Course Activation enabled.
es_es: Si esta opción está activa, entonces el contenido estará restringido para ser accedido solo desde Safe Exam Browser. IMPORTANTE: Para usar esta restricción debe estar instalado el plugin "seb-openedx" en la plataforma Open edX. También se recomienda tener habilitada la Activación de Curso Individual.

source: SEB Browser Keys
es_es: Browser Keys de SEB

source: List of browser keys that are allowed to be accessed from Safe Exam Browser. This keys are generated by SEB.
es_es: Lista de browser keys que se permiten acceder desde Safe Exam Browser. Estas llaves son generadas por SEB.

source: SEB Config Keys
es_es: Config Keys de SEB

source: List of config keys that are allowed to be accessed from Safe Exam Browser. This keys are generated by SEB.
es_es: Lista de config keys que se permiten acceder desde Safe Exam Browser. Estas llaves son generadas por SEB.

source: SEB Whitelist Paths
es_es: Lista Blanca de Rutas para SEB

source: List of paths on the platform are allowed to be accessed from Safe Exam Browser. To allow a restriction at the unit level it is necessary to maintain the "courseware" path in the list.
es_es: Lista de ruta en la plataforma que se permiten acceder desde Safe Exam Browser. Para permitir una restricción a nivel de unidad, es necesario mantener la ruta "courseware" en la lista.

source: Submit
es_es: Enviar
